Revit 2027 API
ElectricalEquipment.SetCircuitNamingSchemeType Method
 Sets the circuit naming scheme for Electrical Equipment.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCircuitNamingSchemeType(
	CircuitNaming circuitNamingType
)
Public Sub SetCircuitNamingSchemeType (
	circuitNamingType As CircuitNaming
)
public:
void SetCircuitNamingSchemeType(
	CircuitNaming circuitNamingType
)
member SetCircuitNamingSchemeType :
        circuitNamingType : CircuitNaming -> unit
Parameters
circuitNamingType CircuitNaming
 The enumerated type of circuit naming scheme to be set.
Exceptions
Exception | Condition
ArgumentException |  The circuit naming scheme enumerated type is invalid for the Electrical Equipment.
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
The following circuit naming scheme type can be set:
CircuitNaming::Prefixed
CircuitNaming::Standard
CircuitNaming::PanelName
CircuitNaming::Phase
CircuitNaming::ProjectSetting
For a customized circuit naming scheme, set its id directly with SetCircuitNamingSchemeId method.
See Also
Reference
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace